#include<free.h>
#include<freertos.h>
#include<task.h>
#include<semphr.h>
#include<init.h>
#include<string.h>
#include<stdio.h>
#include<delay.h>


//Task_Mess_P：任务信息指针
//Free_num：任务数量
void FreeRtos_Mode(Task_Mess*Task_Mess_P,u8 Free_num)//使用FreeRTOS
{
    u8 i;
    
    taskENTER_CRITICAL();//进入临界区
    
    for(i=0;i<Free_num;i++)
    {
        if((Task_Mess_P+i)->priority==0)(Task_Mess_P+i)->priority=i%15+1;//如果不设置优先级，则自动设置优先级
        if((Task_Mess_P+i)->usStackDepth==0)(Task_Mess_P+i)->usStackDepth=128;//如果不分配堆栈，默认设置堆栈=128
        if((Task_Mess_P+i)->pcName[0]=='\0')sprintf((Task_Mess_P+i)->pcName,"task%d",i);//如果不设置任务名，则自动分配任务名
        xTaskCreate((Task_Mess_P+i)->pxTaskCode,Task_Mess_P->pcName,(Task_Mess_P+i)->usStackDepth,(Task_Mess_P+i)->pvParameters,(Task_Mess_P+i)->priority,(Task_Mess_P+i)->Handler);//根据任务数据创建任务
    }
    
    vTaskStartScheduler();//开启任务调度器
    
    taskEXIT_CRITICAL();//退出临界区
    
    while(1);
}


//=========================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================//



